//Лабораторная работа №1 (1 вариант)
//Задание №4
//Пользователь вводит последовательность целых чисел до 0. Определить кол-во чётных чисел и их *

#include <stdio.h>

int main()
{
    int a = 1;
    int b = 0;
    int c = 1;
    printf("-----Для начала подсчёта чётных чисел и их * введите 0-----\n");
    while (a) {
        printf("Введите целое число: ");
        scanf("%d", &a);
        if ((a % 2 == 0) && (a)) {
            b++;
            c *= a;
        }
    }
    if (b != 0) {
        printf("Количество чётных чисел равно: %d\n", b);
        printf("Произведение равно: %d\n", c);
    }
    else {
        printf("Произведение равно: 0\n");
    }
    return 0;
}
